; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-6-45)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	package38 - package
	package39 - package
	package40 - package
	package41 - package
	package42 - package
	package43 - package
	package44 - package
	package45 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p0-3 - location
	p1-0 - location
	p2-0 - location
	p3-1 - location
	p3-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s1)
	(at driver4 s1)
	(at driver5 s1)
	(at driver6 s3)
	(at driver7 s0)
	(at driver8 s1)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at package1 s2)
	(at package2 s3)
	(at package3 s0)
	(at package4 s3)
	(at package5 s1)
	(at package6 s1)
	(at package7 s2)
	(at package8 s0)
	(at package9 s0)
	(at package10 s0)
	(at package11 s1)
	(at package12 s0)
	(at package13 s2)
	(at package14 s3)
	(at package15 s0)
	(at package16 s1)
	(at package17 s1)
	(at package18 s1)
	(at package19 s1)
	(at package20 s3)
	(at package21 s1)
	(at package22 s3)
	(at package23 s2)
	(at package24 s3)
	(at package25 s2)
	(at package26 s1)
	(at package27 s1)
	(at package28 s1)
	(at package29 s0)
	(at package30 s2)
	(at package31 s1)
	(at package32 s2)
	(at package33 s1)
	(at package34 s2)
	(at package35 s2)
	(at package36 s2)
	(at package37 s3)
	(at package38 s3)
	(at package39 s0)
	(at package40 s0)
	(at package41 s2)
	(at package42 s0)
	(at package43 s1)
	(at package44 s2)
	(at package45 s3)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(link s0 s1)
	(link s1 s0)
	(link s0 s3)
	(link s3 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s3)
	(link s3 s2)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s1)
	(at driver4 s3)
	(at driver6 s2)
	(at driver7 s2)
	(at driver8 s1)
	(at truck3 s0)
	(at truck4 s0)
	(at package1 s0)
	(at package2 s0)
	(at package3 s1)
	(at package4 s2)
	(at package5 s3)
	(at package6 s1)
	(at package7 s3)
	(at package8 s3)
	(at package9 s3)
	(at package10 s3)
	(at package11 s2)
	(at package12 s1)
	(at package13 s2)
	(at package14 s2)
	(at package15 s3)
	(at package16 s1)
	(at package17 s3)
	(at package18 s0)
	(at package19 s0)
	(at package20 s0)
	(at package21 s1)
	(at package22 s2)
	(at package23 s0)
	(at package24 s3)
	(at package25 s0)
	(at package26 s2)
	(at package27 s3)
	(at package28 s1)
	(at package29 s2)
	(at package30 s2)
	(at package31 s0)
	(at package32 s3)
	(at package33 s2)
	(at package34 s2)
	(at package35 s0)
	(at package36 s1)
	(at package37 s3)
	(at package38 s0)
	(at package39 s0)
	(at package40 s3)
	(at package41 s0)
	(at package42 s2)
	(at package43 s3)
	(at package44 s2)
	(at package45 s1)
	))


)

; plan
1. (load-truck s1 package5 truck1)
   deleted: (at package5 s1)
   added: (in package5 truck1)
   goals met: 14 of 53
2. (board-truck driver4 s1 truck1)
   deleted: (at driver4 s1) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 14 of 53
3. (load-truck s1 package43 truck1)
   deleted: (at package43 s1)
   added: (in package43 truck1)
   goals met: 14 of 53
4. (drive-truck driver4 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 14 of 53
5. (unload-truck s3 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s3)
   goals met: 15 of 53
6. (load-truck s3 package45 truck1)
   deleted: (at package45 s3)
   added: (in package45 truck1)
   goals met: 15 of 53
7. (drive-truck driver4 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 15 of 53
8. (unload-truck s1 package45 truck1)
   deleted: (in package45 truck1)
   added: (at package45 s1)
   goals met: 16 of 53
9. (load-truck s1 package33 truck1)
   deleted: (at package33 s1)
   added: (in package33 truck1)
   goals met: 16 of 53
10. (drive-truck driver4 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 16 of 53
11. (load-truck s2 package7 truck1)
   deleted: (at package7 s2)
   added: (in package7 truck1)
   goals met: 16 of 53
12. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 16 of 53
13. (unload-truck s3 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s3)
   goals met: 17 of 53
14. (unload-truck s3 package43 truck1)
   deleted: (in package43 truck1)
   added: (at package43 s3)
   goals met: 18 of 53
15. (drive-truck driver4 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 18 of 53
16. (load-truck s2 package41 truck1)
   deleted: (at package41 s2)
   added: (in package41 truck1)
   goals met: 18 of 53
17. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 18 of 53
18. (load-truck s0 package9 truck1)
   deleted: (at package9 s0)
   added: (in package9 truck1)
   goals met: 18 of 53
19. (load-truck s0 package8 truck1)
   deleted: (at package8 s0)
   added: (in package8 truck1)
   goals met: 18 of 53
20. (drive-truck driver4 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 18 of 53
21. (unload-truck s3 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s3)
   goals met: 19 of 53
22. (unload-truck s3 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s3)
   goals met: 20 of 53
23. (drive-truck driver4 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 20 of 53
24. (load-truck s0 package42 truck1)
   deleted: (at package42 s0)
   added: (in package42 truck1)
   goals met: 20 of 53
25. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 20 of 53
26. (unload-truck s2 package42 truck1)
   deleted: (in package42 truck1)
   added: (at package42 s2)
   goals met: 21 of 53
27. (load-truck s2 package36 truck1)
   deleted: (at package36 s2)
   added: (in package36 truck1)
   goals met: 21 of 53
28. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 21 of 53
29. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 21 of 53
30. (unload-truck s1 package36 truck1)
   deleted: (in package36 truck1)
   added: (at package36 s1)
   goals met: 22 of 53
31. (load-truck s1 package31 truck1)
   deleted: (at package31 s1)
   added: (in package31 truck1)
   goals met: 22 of 53
32. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 22 of 53
33. (unload-truck s0 package41 truck1)
   deleted: (in package41 truck1)
   added: (at package41 s0)
   goals met: 23 of 53
34. (load-truck s0 package40 truck1)
   deleted: (at package40 s0)
   added: (in package40 truck1)
   goals met: 23 of 53
35. (drive-truck driver4 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 23 of 53
36. (unload-truck s3 package40 truck1)
   deleted: (in package40 truck1)
   added: (at package40 s3)
   goals met: 24 of 53
37. (load-truck s3 package4 truck1)
   deleted: (at package4 s3)
   added: (in package4 truck1)
   goals met: 24 of 53
38. (drive-truck driver4 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 24 of 53
39. (unload-truck s2 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 25 of 53
40. (load-truck s2 package35 truck1)
   deleted: (at package35 s2)
   added: (in package35 truck1)
   goals met: 25 of 53
41. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 25 of 53
42. (unload-truck s0 package35 truck1)
   deleted: (in package35 truck1)
   added: (at package35 s0)
   goals met: 26 of 53
43. (unload-truck s0 package31 truck1)
   deleted: (in package31 truck1)
   added: (at package31 s0)
   goals met: 27 of 53
44. (drive-truck driver4 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 27 of 53
45. (load-truck s3 package38 truck1)
   deleted: (at package38 s3)
   added: (in package38 truck1)
   goals met: 27 of 53
46. (drive-truck driver4 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 27 of 53
47. (unload-truck s0 package38 truck1)
   deleted: (in package38 truck1)
   added: (at package38 s0)
   goals met: 28 of 53
48. (load-truck s0 package3 truck1)
   deleted: (at package3 s0)
   added: (in package3 truck1)
   goals met: 28 of 53
49. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 28 of 53
50. (unload-truck s1 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   goals met: 29 of 53
51. (load-truck s1 package27 truck1)
   deleted: (at package27 s1)
   added: (in package27 truck1)
   goals met: 29 of 53
52. (drive-truck driver4 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 29 of 53
53. (unload-truck s3 package27 truck1)
   deleted: (in package27 truck1)
   added: (at package27 s3)
   goals met: 30 of 53
54. (load-truck s3 package22 truck1)
   deleted: (at package22 s3)
   added: (in package22 truck1)
   goals met: 30 of 53
55. (drive-truck driver4 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 30 of 53
56. (unload-truck s2 package33 truck1)
   deleted: (in package33 truck1)
   added: (at package33 s2)
   goals met: 31 of 53
57. (load-truck s2 package32 truck1)
   deleted: (at package32 s2)
   added: (in package32 truck1)
   goals met: 31 of 53
58. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 31 of 53
59. (unload-truck s3 package32 truck1)
   deleted: (in package32 truck1)
   added: (at package32 s3)
   goals met: 32 of 53
60. (load-truck s3 package20 truck1)
   deleted: (at package20 s3)
   added: (in package20 truck1)
   goals met: 32 of 53
61. (drive-truck driver4 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 32 of 53
62. (load-truck s0 package29 truck1)
   deleted: (at package29 s0)
   added: (in package29 truck1)
   goals met: 32 of 53
63. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 32 of 53
64. (unload-truck s2 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s2)
   goals met: 33 of 53
65. (load-truck s2 package25 truck1)
   deleted: (at package25 s2)
   added: (in package25 truck1)
   goals met: 33 of 53
66. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 33 of 53
67. (unload-truck s0 package25 truck1)
   deleted: (in package25 truck1)
   added: (at package25 s0)
   goals met: 34 of 53
68. (unload-truck s0 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s0)
   goals met: 35 of 53
69. (load-truck s0 package15 truck1)
   deleted: (at package15 s0)
   added: (in package15 truck1)
   goals met: 35 of 53
70. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 35 of 53
71. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 35 of 53
72. (load-truck s3 package2 truck1)
   deleted: (at package2 s3)
   added: (in package2 truck1)
   goals met: 35 of 53
73. (unload-truck s3 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s3)
   goals met: 36 of 53
74. (drive-truck driver4 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 36 of 53
75. (unload-truck s0 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   goals met: 37 of 53
76. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 37 of 53
77. (load-truck s2 package23 truck1)
   deleted: (at package23 s2)
   added: (in package23 truck1)
   goals met: 37 of 53
78. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 37 of 53
79. (unload-truck s0 package23 truck1)
   deleted: (in package23 truck1)
   added: (at package23 s0)
   goals met: 38 of 53
80. (load-truck s0 package12 truck1)
   deleted: (at package12 s0)
   added: (in package12 truck1)
   goals met: 38 of 53
81. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 38 of 53
82. (load-truck s1 package26 truck1)
   deleted: (at package26 s1)
   added: (in package26 truck1)
   goals met: 38 of 53
83. (load-truck s1 package19 truck1)
   deleted: (at package19 s1)
   added: (in package19 truck1)
   goals met: 38 of 53
84. (load-truck s1 package18 truck1)
   deleted: (at package18 s1)
   added: (in package18 truck1)
   goals met: 38 of 53
85. (load-truck s1 package17 truck1)
   deleted: (at package17 s1)
   added: (in package17 truck1)
   goals met: 38 of 53
86. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 38 of 53
87. (unload-truck s0 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s0)
   goals met: 39 of 53
88. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 39 of 53
89. (unload-truck s2 package26 truck1)
   deleted: (in package26 truck1)
   added: (at package26 s2)
   goals met: 40 of 53
90. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 40 of 53
91. (unload-truck s3 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s3)
   goals met: 41 of 53
92. (load-truck s3 package14 truck1)
   deleted: (at package14 s3)
   added: (in package14 truck1)
   goals met: 41 of 53
93. (drive-truck driver4 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 41 of 53
94. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 41 of 53
95. (unload-truck s2 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s2)
   goals met: 42 of 53
96. (unload-truck s2 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s2)
   goals met: 43 of 53
97. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 43 of 53
98. (unload-truck s0 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s0)
   goals met: 44 of 53
99. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 44 of 53
100. (unload-truck s1 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s1)
   goals met: 45 of 53
101. (load-truck s1 package11 truck1)
   deleted: (at package11 s1)
   added: (in package11 truck1)
   goals met: 45 of 53
102. (drive-truck driver4 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 45 of 53
103. (unload-truck s2 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s2)
   goals met: 46 of 53
104. (load-truck s2 package1 truck1)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   goals met: 46 of 53
105. (board-truck driver3 s1 truck3)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 46 of 53
106. (drive-truck driver3 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 47 of 53
107. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 47 of 53
108. (unload-truck s0 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   goals met: 48 of 53
109. (drive-truck driver4 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 48 of 53
110. (disembark-truck driver4 s3 truck1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s3) (empty truck1)
   goals met: 49 of 53
111. (load-truck s0 package10 truck3)
   deleted: (at package10 s0)
   added: (in package10 truck3)
   goals met: 49 of 53
112. (walk driver2 s0 p1-0)
   deleted: (at driver2 s0)
   added: (at driver2 p1-0)
   goals met: 49 of 53
113. (walk driver2 p1-0 s1)
   deleted: (at driver2 p1-0)
   added: (at driver2 s1)
   goals met: 50 of 53
114. (walk driver6 s3 p3-2)
   deleted: (at driver6 s3)
   added: (at driver6 p3-2)
   goals met: 50 of 53
115. (walk driver6 p3-2 s2)
   deleted: (at driver6 p3-2)
   added: (at driver6 s2)
   goals met: 51 of 53
116. (walk driver7 s0 p2-0)
   deleted: (at driver7 s0)
   added: (at driver7 p2-0)
   goals met: 51 of 53
117. (walk driver7 p2-0 s2)
   deleted: (at driver7 p2-0)
   added: (at driver7 s2)
   goals met: 52 of 53
118. (drive-truck driver3 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 51 of 53
119. (unload-truck s3 package10 truck3)
   deleted: (in package10 truck3)
   added: (at package10 s3)
   goals met: 52 of 53
120. (drive-truck driver3 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 53 of 53
